[{"data":1,"prerenderedAt":423},["ShallowReactive",2],{"post-2026-02-20-xiaomi-china-version-fcm-push-debug-en":3,"surround-2026-02-20-xiaomi-china-version-fcm-push-debug-en":413,"randomIndex/2026/02/20/xiaomi-china-version-fcm-push-debug/":421,"language-switch-/en/2026/02/20/xiaomi-china-version-fcm-push-debug/-zh":422},{"title":4,"date":5,"path":6,"tags":7,"body":11,"description":17},"Mainland China Xiaomi FCM Screen-Off Disconnection: Attempts and Possible Solutions in a Rootless Environment","2026-02-20","/2026/02/20/xiaomi-china-version-fcm-push-debug",[8,9,10],"Android","Network","Hardware",{"type":12,"value":13,"toc":392},"minimark",[14,18,21,24,29,45,49,57,68,71,77,80,84,87,90,94,97,102,105,108,112,119,122,160,163,185,188,194,206,209,218,221,225,228,231,235,238,244,247,269,272,276,279,288,291,294,298,307,316,319,325,329,332,335,339,388],[15,16,17],"p",{},"In November last year, I got a new mainland China version Xiaomi 15 as my daily driver. Actually, my previous Redmi K70 Ultra was released in the same year as this Xiaomi 15, and performance-wise they're comparable. However, during my Gap Year while traveling across the country, I realized it was a shame not being able to capture the night scenes I encountered, so I wanted to switch to a phone with better camera capabilities. The newly released Xiaomi 17 was at a premium price point, and didn't offer significant improvements over the 15, so I went directly for the Xiaomi 15.",[15,19,20],{},"After getting it, I followed my usual habits and enabled \"Google Base Services\" in settings, installed \"Google Play\" and started using it normally. But over these past few months, I discovered that my FCM push notifications—whether Outlook email notifications or a certain instant messaging app that looks like a paper airplane—never seemed to work properly from the start. Their notifications would occasionally pop up suddenly after I unlocked my phone, but more often they just disappeared. I would only receive the backlogged notifications when I manually opened the corresponding apps.",[15,22,23],{},"Recently I received an offer from an overseas university and will be going abroad in September to pursue a master's degree, so I wanted to resolve this issue before leaving the country. After all, when living in China, most apps can push messages to me through MiPush, and these FCM-dependent apps weren't my most frequently used ones. I could just open them manually when I woke up each day to receive notifications. Even if my message response time wasn't great, it wasn't a big deal—if there was something urgent, my family and friends knew other ways to reach me faster. But once abroad, FCM push notifications become critically important, so I need to fix this issue quickly, or I'll have to consider switching phones.",[25,26,28],"h2",{"id":27},"test-environment","Test Environment",[30,31,32,36,39,42],"ul",{},[33,34,35],"li",{},"Xiaomi 15 mainland China version, 16GB + 512GB, HyperOS 3.0.7.0.WOCCNXM, the latest version as of this writing",[33,37,38],{},"\"Google Base Services\" enabled, \"Google Play\" installed",[33,40,41],{},"Connected to WiFi, with WiFi-routed data exit IP in 🇺🇸 Los Angeles",[33,43,44],{},"MIUI optimization not disabled",[25,46,48],{"id":47},"getting-fcm-running-first","Getting FCM Running First",[15,50,51,52,56],{},"I needed to first resolve the issue of FCM not receiving messages even when the screen is on. In the \"Phone\" app's dialer, entering ",[53,54,55],"code",{},"*#*#426#*#*"," opens the FCM Diagnostics interface, which contains logs about FCM connection status.",[15,58,59,64],{},[60,61],"img",{"alt":62,"src":63},"Dialer Input","https://static.031130.xyz/uploads/2026/02/20/6202d116db231.webp",[60,65],{"alt":66,"src":67},"FCM Diagnostics Interface","https://static.031130.xyz/uploads/2026/02/20/432922f339849.webp",[15,69,70],{},"In this interface, I found that FCM's connection status was actually normal, with no obvious error messages in the logs. So I started suspecting that some of HyperOS's power-saving mechanisms were interfering with FCM's normal operation in the background. Through some searching on Xiaohongshu (Little Red Book), I discovered that enabling \"Autostart\" permission for apps requiring FCM push in the settings interface, and setting battery optimization to \"Don't optimize,\" seemed to solve this problem.",[15,72,73],{},[60,74],{"alt":75,"src":76},"App Settings Interface","https://static.031130.xyz/uploads/2026/02/20/8c20be931764b.webp",[15,78,79],{},"Testing with an IM app (sending messages from one account to another), I found that with the screen on, FCM could now receive messages normally even when the app was closed in the background.",[25,81,83],{"id":82},"the-problem-of-fcm-disconnecting-one-minute-after-screen-off","The Problem of FCM Disconnecting One Minute After Screen-Off",[15,85,86],{},"However, after turning off the screen and leaving it idle for a minute, FCM stopped working completely. Whether email notifications or IM messages, none could be pushed to the phone via FCM. Only when I lit up the screen would the backlogged notifications suddenly appear. Checking the FCM Diagnostics interface again, FCM's connection status was either disconnected or had just connected for a few seconds. This indicates that in the lock screen state, FCM's connection gets terminated by the system, preventing message reception.",[15,88,89],{},"PS: I discovered that when charging, even with the phone locked, FCM maintains its connection and receives messages normally. This further confirms that HyperOS's power-saving mechanisms are interfering with FCM's normal operation.",[25,91,93],{"id":92},"possible-solutions","Possible Solutions",[15,95,96],{},"After searching on Xiaohongshu and Xiaolüshu (CoolApk), I found some attempts and solutions from others:",[98,99,101],"h3",{"id":100},"_1-disable-miui-optimization","1. Disable MIUI Optimization",[15,103,104],{},"This is my least favorite solution, because MIUI optimization is actually an important reason why I like HyperOS (MIUI). After disabling MIUI optimization, I found that the remaining battery percentage information can't be displayed inside the status bar battery icon—it must appear to the right of the battery icon. This is a huge waste of status bar space after HyperOS introduced the Super Island (Dynamic Island). Of course, there are other features that would be affected, but this is what I care about most.",[15,106,107],{},"Additionally, in HyperOS 3's developer mode, the \"Disable MIUI optimization\" option can no longer be found, though some users report you can make this option reappear through methods like resetting settings status, but I don't think this is a good solution.",[98,109,111],{"id":110},"_2-freeze-battery-performance-app-or-replace-with-international-version","2. Freeze \"Battery & Performance\" App or Replace with International Version",[15,113,114,115],{},"On HyperOS 2, some users reported that tampering with the \"Battery & Performance\" system app could solve the FCM screen-off disconnection problem. I tried using adb shell to freeze it, but after testing, this wasn't a useful solution, and it might cause some system scheduling anomalies. ",[116,117,118],"strong",{},"Also, don't enter ultra power saving mode, because that mode's UI is provided by the \"Battery & Performance\" app!!",[15,120,121],{},"The adb command is as follows:",[123,124,129],"pre",{"className":125,"code":126,"language":127,"meta":128,"style":128},"language-bash shiki shiki-themes one-light one-dark-pro","adb shell pm uninstall --user 0 com.miui.powerkeeper\n","bash","",[53,130,131],{"__ignoreMap":128},[132,133,136,140,144,147,150,154,157],"span",{"class":134,"line":135},"line",1,[132,137,139],{"class":138},"sAdtL","adb",[132,141,143],{"class":142},"sDhpE"," shell",[132,145,146],{"class":142}," pm",[132,148,149],{"class":142}," uninstall",[132,151,153],{"class":152},"sAGMh"," --user",[132,155,156],{"class":152}," 0",[132,158,159],{"class":142}," com.miui.powerkeeper\n",[15,161,162],{},"If you want to restore it, you can reinstall this app with the following command:",[123,164,166],{"className":125,"code":165,"language":127,"meta":128,"style":128},"adb shell cmd package install-existing com.miui.powerkeeper\n",[53,167,168],{"__ignoreMap":128},[132,169,170,172,174,177,180,183],{"class":134,"line":135},[132,171,139],{"class":138},[132,173,143],{"class":142},[132,175,176],{"class":142}," cmd",[132,178,179],{"class":142}," package",[132,181,182],{"class":142}," install-existing",[132,184,159],{"class":142},[15,186,187],{},"Some people also reported that replacing it with the international version of the \"Battery & Performance\" app could solve this problem, but I couldn't find the installation package for the HyperOS 3 international version's \"Battery & Performance\" app. After downloading and unpacking the complete ROM for the Xiaomi 15 overseas version, that app's apk couldn't be directly updated or installed via adb either.",[15,189,190],{},[60,191],{"alt":192,"src":193},"Update Failed","https://static.031130.xyz/uploads/2026/02/20/58ba6ce88ef49.webp",[98,195,197,198,205],{"id":196},"_3-use-fcmfix-and-other-xposed-modules-after-unlocking-bootloader","3. Use ",[199,200,204],"a",{"href":201,"rel":202},"https://github.com/kooritea/fcmfix",[203],"nofollow","fcmfix"," and Other Xposed Modules After Unlocking Bootloader",[15,207,208],{},"This solution is... forget it. Although I have a level 5 account on the Xiaomi community, I don't have the energy to participate in the \"Xiaomi entrance exam\" (I heard it's been suspended anyway). Moreover, after unlocking the bootloader, I might face a series of problems like payment apps not working. If I wanted to cover up related traces, I'd have to go through more hassle—it feels like more trouble than it's worth.",[98,210,212,213],{"id":211},"_4-use-heartbeatfixerforgcm","4. Use ",[199,214,217],{"href":215,"rel":216},"https://github.com/shaobin0604/HeartbeatFixerForGCM",[203],"HeartbeatFixerForGCM",[15,219,220],{},"This software has been removed from Google Play and hasn't been updated in a long time. Testing shows it cannot prevent FCM from being disconnected by the system in lock screen state on HyperOS 3.",[98,222,224],{"id":223},"_5-use-gboard-to-keep-fcm-alive","5. Use Gboard to Keep FCM Alive",[15,226,227],{},"Although I don't know the principle, some users reported that installing Gboard keyboard allows FCM to maintain its connection and receive messages normally in lock screen state. I tried it too, and indeed after installing Gboard and setting it as the default input method, FCM could maintain its connection in lock screen state.",[15,229,230],{},"However, this solution isn't perfect either. After all, I don't like Gboard's input experience, so I can't really accept this solution.",[25,232,234],{"id":233},"some-personal-experiments","Some Personal Experiments",[15,236,237],{},"Although I don't have much experience with Android development—only touching it during a sophomore year course project—the AI era has given me the ability to do vibe coding.",[15,239,240],{},[60,241],{"alt":242,"src":243},"Attempting to use vibe coding to modify source code and compile","https://static.031130.xyz/uploads/2026/02/20/51db4ed4ef15b.webp",[15,245,246],{},"So I also had AI modify some logic for keeping FCM alive based on HeartbeatFixerForGCM's open-source code, roughly following these approaches:",[30,248,249,252,255,258,261],{},[33,250,251],{},"Input Method Keep-Alive: Continuing Gboard's approach, using the persistent nature of input method services to maintain FCM connection. It could keep FCM alive, but lost the input capability of the input method—pass.",[33,253,254],{},"Notification Listening: NotificationListener as a system listening role to increase persistence probability—no success, pass.",[33,256,257],{},"Foreground Service: Persistent notification + FGS to elevate process survival priority—no success, pass.",[33,259,260],{},"Accessibility Keep-Alive: Accessibility service also as a system listening role to increase persistence probability—no success, pass.",[33,262,263,264,268],{},"VPN Keep-Alive: Using VPN service's persistent nature to maintain FCM connection. Don't know if it has any effect, ",[265,266,267],"del",{},"but it did manage to disconnect my phone's network","—pass.",[15,270,271],{},"In short, none of these attempts succeeded. FCM still gets disconnected by the system in lock screen state.",[25,273,275],{"id":274},"seems-like-i-found-a-viable-solution","Seems Like I Found a Viable Solution?",[15,277,278],{},"Just when I was at my wit's end and ready to shop for another phone, I saw a Xiaohongshu post mentioning that you could first uninstall updates to \"Google Play Services,\" then update it again to the latest version. The poster's explanation was to first uninstall the mainland-optimized Play Services, then install an un-optimized version from the Play Store, which could solve this problem.",[15,280,281,282,287],{},"Although you can't directly find the \"Google Play Services\" app on the Play Store, you can search for \"Google Play Services\" using your phone's browser, click the link from google.com, and it will automatically jump to the \"Google Play Services\" app page on the Play Store. You can also click ",[199,283,286],{"href":284,"rel":285},"https://play.google.com/store/apps/details?id=com.google.android.gms",[203],"here"," directly.",[15,289,290],{},"I tried it too, and indeed after uninstalling updates to \"Google Play Services,\" FCM could maintain its connection in lock screen state. Although this solution sounds a bit mystical and I can't see the actual principle at work, since it was effective, I didn't dwell on it.",[15,292,293],{},"But just when I thought the problem was solved, while writing this article, I tried restarting my phone and found the problem had returned. And after restarting, repeating the above steps of uninstalling updates to \"Google Play Services\" still didn't solve the problem. This troubled me greatly, so I started recalling the previous operation steps, but I could never reproduce the previous state...",[25,295,297],{"id":296},"wait-there-seems-to-be-a-fallback","Wait, There Seems to Be a Fallback",[15,299,300,301,306],{},"While discussing this issue with a ",[199,302,305],{"href":303,"rel":304},"https://github.com/Rurikobaka/",[203],"seasoned Android enthusiast",", he pointed out that mainland OS indeed disconnects FCM's long connection after screen-off to save power, but still maintains a periodic check mechanism. This seems to match some isolated cases I encountered during testing. This periodic check interval is quite long—according to his estimate, around 10-20 minutes. I also conducted a round of testing myself. The process was:",[308,309,310,313],"ol",{},[33,311,312],{},"Screen off for one minute, use secondary account to send message to main account, wait 6 minutes until main account receives the message, notified by my Xiaomi band's vibration that the message arrived.",[33,314,315],{},"Immediately use secondary account to send another message to main account, wait for main account to receive the second message, record the time difference between the two messages.",[15,317,318],{},"Because the time interval is quite long, I only tested one and a half rounds. The first round's time difference was 28 minutes, and the second round's time difference reached 38 minutes.",[15,320,321,322],{},"Conclusion: ",[116,323,324],{},"In screen-off state, although FCM's connection gets disconnected by the system, the system will automatically wake up FCM approximately every 30 minutes (inaccurate data) to check for new messages. If there are any, you'll receive notifications.",[25,326,328],{"id":327},"conclusion","Conclusion",[15,330,331],{},"Currently, to receive FCM push notifications on mainland China version Xiaomi phones, you can only choose between using Gboard + real-time push / periodic check mechanism fallback.",[15,333,334],{},"The former uses Gboard input method's persistent nature to maintain FCM connection, enabling real-time message reception in screen-off state, but requires sacrificing input experience; the latter uses system periodic FCM wake-ups to check for new messages. While not requiring sacrifice of input experience, there may be delays exceeding half an hour.",[25,336,338],{"id":337},"references","References",[30,340,341,348,355,362,369,375,385],{},[33,342,343],{},[199,344,347],{"href":345,"rel":346},"https://www.mobile01.com/topicdetail.php?f=634&t=6892724",[203],"【HyperOS】修復小米陸版通知推送 - Mobile01",[33,349,350],{},[199,351,354],{"href":352,"rel":353},"https://www.v2ex.com/t/993090",[203],"如何解决原生 Android 续航问题？ - V2EX",[33,356,357],{},[199,358,361],{"href":359,"rel":360},"https://staging.v2ex.com/t/1089681",[203],"小米 15/hyperOS 2.0 打开 FCM 通知 - V2EX",[33,363,364],{},[199,365,368],{"href":366,"rel":367},"https://www.threads.com/@silicon.salmon/post/DDR_SD8y3Gp",[203],"海外不建議購買內地版小米手機 因為一鎖屏就斷連 FCM， 導致海外 App 收不到消息推送。 亮屏後 FCM，會嘗試重連。 重連成功，才能收到通知。 已開自啟動，電池無限制。 有什麼解決辦法？ 香港澳門| salmon0105",[33,370,371],{},[199,372,374],{"href":215,"rel":373},[203],"shaobin0604/HeartbeatFixerForGCM: Tiny application to fix GCM push notification delay issue",[33,376,377],{},[199,378,380,381,384],{"href":201,"rel":379},[203],"kooritea/fcmfix: ",[132,382,383],{},"xposed","让fcm唤醒已完全停止的应用",[33,386,387],{},"Various discussions and feedback on social platforms like Xiaohongshu and CoolApk. Since the content is rather scattered and unsystematic, I won't list them all here. Interested readers can search for relevant keywords to view them.",[389,390,391],"style",{},"html pre.shiki code .sAdtL, html code.shiki .sAdtL{--shiki-default:#4078F2;--shiki-dark:#61AFEF}html pre.shiki code .sDhpE, html code.shiki .sDhpE{--shiki-default:#50A14F;--shiki-dark:#98C379}html pre.shiki code .sAGMh, html code.shiki .sAGMh{--shiki-default:#986801;--shiki-dark:#D19A66}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}",{"title":128,"searchDepth":393,"depth":393,"links":394},2,[395,396,397,398,408,409,410,411,412],{"id":27,"depth":393,"text":28},{"id":47,"depth":393,"text":48},{"id":82,"depth":393,"text":83},{"id":92,"depth":393,"text":93,"children":399},[400,402,403,405,407],{"id":100,"depth":401,"text":101},3,{"id":110,"depth":401,"text":111},{"id":196,"depth":401,"text":404},"3. Use fcmfix and Other Xposed Modules After Unlocking Bootloader",{"id":211,"depth":401,"text":406},"4. Use HeartbeatFixerForGCM",{"id":223,"depth":401,"text":224},{"id":233,"depth":393,"text":234},{"id":274,"depth":393,"text":275},{"id":296,"depth":393,"text":297},{"id":327,"depth":393,"text":328},{"id":337,"depth":393,"text":338},[414,415],null,{"title":416,"path":417,"stem":418,"date":419,"lang":420,"children":-1},"I Can’t Access dl.google.com — A Network Debugging Story Under TUN","/2026/01/31/mihomo-tun-fail-to-visit-dl-google-com","posts/en/mihomo-tun-fail-to-visit-dl-google-com","2026-01-31","en",0,"/2026/02/20/xiaomi-china-version-fcm-push-debug/",1771555478203]