[{"data":1,"prerenderedAt":408},["ShallowReactive",2],{"post-2025-10-16-how-s-mozilla-crlite-going-now-en":3,"surround-2025-10-16-how-s-mozilla-crlite-going-now-en":394,"randomIndex/2025/10/16/how-s-mozilla-crlite-going-now/":406,"language-switch-/en/2025/10/16/how-s-mozilla-crlite-going-now/-zh":407},{"title":4,"date":5,"path":6,"tags":7,"body":14,"description":20},"Post-OCSP Era: How Browsers Address New Certificate Revocation Challenges","2025-10-16 15:38:50","/2025/10/16/how-s-mozilla-crlite-going-now",[8,9,10,11,12,13],"SSL","Firefox","Web PKI","OCSP","CRLSets","CRLite",{"type":15,"value":16,"toc":381},"minimark",[17,21,32,41,54,60,65,76,79,86,96,103,108,115,119,122,125,137,141,144,153,174,177,181,184,197,200,224,243,246,253,256,259,263,266,288,295,301,305],[18,19,20],"p",{},"In August 2023, the CA/Browser Forum passed a vote eliminating the requirement for publicly trusted CAs like Let's Encrypt to maintain OCSP servers.",[18,22,23,24,31],{},"In July 2024, Let's Encrypt published a ",[25,26,30],"a",{"href":27,"rel":28},"https://letsencrypt.org/2024/07/23/replacing-ocsp-with-crls",[29],"nofollow","blog post"," disclosing its plans to shut down its OCSP server.",[18,33,34,35,40],{},"In December of the same year, Let's Encrypt released ",[25,36,39],{"href":37,"rel":38},"https://letsencrypt.org/2024/12/05/ending-ocsp",[29],"a timeline for shutting down its OCSP server",", with the following key dates:",[42,43,44,48,51],"ul",{},[45,46,47],"li",{},"January 30, 2025 - Let's Encrypt will no longer accept new certificate issuance requests containing the OCSP Must-Staple extension, unless your account has previously requested such certificates",[45,49,50],{},"May 7, 2025 - Newly issued certificates from Let's Encrypt will include CRL URLs but will no longer contain OCSP URLs, and all new certificate issuance requests with the OCSP Must-Staple extension will be rejected",[45,52,53],{},"August 6, 2025 - Let's Encrypt will shut down its OCSP servers",[18,55,56],{},[57,58,59],"strong",{},"Let's Encrypt is the world's largest free SSL certificate authority, and this move marks our gradual transition into the post-OCSP era.",[61,62,64],"h2",{"id":63},"ocsps-dilemma-the-trade-off-between-performance-and-privacy","OCSP's Dilemma: The Trade-off Between Performance and Privacy",[18,66,67,68,71,72,75],{},"Behind Let's Encrypt's decision lies long-accumulated dissatisfaction with OCSP (Online Certificate Status Protocol). OCSP, as a method for real-time certificate validity queries, had a beautiful initial vision: when a browser accesses a website, it can send a brief request to the ",[57,69,70],{},"CA's (Certificate Authority's)"," OCSP server, asking whether the certificate is still valid. This seemed much more efficient than downloading a massive ",[57,73,74],{},"CRL (Certificate Revocation List)",".",[18,77,78],{},"However, OCSP has exposed numerous flaws in practical application:",[18,80,81,82,85],{},"First is the ",[57,83,84],{},"performance issue",". Although individual requests are small, when millions of users simultaneously access websites, OCSP servers must handle massive amounts of real-time queries. This not only creates enormous server pressure for CAs but also increases latency for users accessing websites. If OCSP servers respond slowly or even crash, browsers may interrupt connections due to inability to confirm certificate status, or have to \"turn a blind eye\" for the sake of user experience, both of which undermine OCSP's security.",[18,87,88,89,92,93],{},"More seriously is the ",[57,90,91],{},"privacy issue",". Each OCSP query essentially reports the user's browsing behavior to the CA. This means the CA can know when a user accessed which website. While OCSP queries themselves don't contain personally identifiable information, by combining this information with data like IP addresses, CAs can completely build profiles of users' browsing habits. For privacy-conscious users and developers, this \"silent surveillance\" is unacceptable. ",[57,94,95],{},"Even if CAs intentionally don't retain this information, regional laws may force CAs to collect it.",[18,97,98,99,102],{},"Furthermore, OCSP has ",[57,100,101],{},"security flaws"," in its design. Due to concerns about connection timeouts affecting user experience, browsers typically default to a soft-fail mechanism: if they cannot connect to the OCSP server, they choose to allow rather than block the connection. Attackers can exploit this by blocking communication between the client and OCSP server, causing queries to always timeout, thus easily bypassing certificate status verification.",[104,105,107],"h3",{"id":106},"ocsp-stapling","OCSP Stapling",[18,109,110,111,75],{},"Based on these flaws, we have the OCSP stapling solution, which ",[25,112,114],{"href":113},"/2024/11/19/firefox-is-the-only-mainstream-brower-doing-online-certificate-revocation-checks/#OCSP-%E8%A3%85%E8%AE%A2-OCSP-stapling","I covered in last year's blog post, feel free to review",[104,116,118],{"id":117},"ocsp-must-staple","OCSP Must-Staple",[18,120,121],{},"OCSP Must-Staple is an extension option when applying for SSL certificates. This extension tells the browser: if it recognizes this extension in the certificate, it must not send query requests to the certificate authority, but should obtain the stapled copy during the handshake phase. If a valid copy cannot be obtained, the browser should refuse the connection.",[18,123,124],{},"This feature gave browser developers the courage for hard-fail, but before OCSP faded from history, Let's Encrypt seemed to be the only mainstream CA supporting this extension, and this feature was not widely used.",[18,126,127,131,132,75],{},[128,129,130],"del",{},"I originally didn't want to introduce this feature (because literally no one used it), but considering this thing is about to be buried, let's erect a monument for it on the Chinese internet,"," for more information, refer to ",[25,133,136],{"href":134,"rel":135},"https://letsencrypt.org/2024/12/05/ending-ocsp#must-staple",[29],"Let's Encrypt's blog",[61,138,140],{"id":139},"chromiums-solution-taking-only-a-ladle-from-three-thousand-waters","Chromium's Solution: Taking Only a Ladle from Three Thousand Waters",[18,142,143],{},"OCSP's privacy and performance issues are no secret, and browser vendors have long begun their own explorations. In 2012, Chrome disabled CRLs and OCSP checks by default, turning to its own self-designed certificate verification mechanism.",[18,145,146,147,152],{},"It's well known that revocation lists can be extremely large. If browsers needed to download and parse a complete global revocation list, it would be a performance disaster (Mozilla's team mentioned in ",[25,148,151],{"href":149,"rel":150},"https://hacks.mozilla.org/2025/08/crlite-fast-private-and-comprehensive-certificate-revocation-checking-in-firefox/",[29],"this year's blog"," that file sizes from downloading 3000 active CRLs would reach 300MB). Through analyzing historical data, the Chromium team discovered that most revoked certificates belong to a few high-risk categories, such as the certificate authority (CA) itself being compromised, or certificates from certain large websites being revoked. Based on this insight, CRLSets adopts the following strategy:",[154,155,156,162,168],"ol",{},[45,157,158,161],{},[57,159,160],{},"Tiered Revocation",": Chromium doesn't download all revoked certificate information, but rather the Google team maintains a streamlined list containing the \"most important\" revocation information. This list is regularly updated and pushed to users through Chrome browser updates.",[45,163,164,167],{},[57,165,166],{},"Streamlined Efficiency",": This list is very small in size, currently about 600KB. It contains certificates that would cause large-scale security incidents if abused, such as CA intermediate certificates, or certificates from some well-known websites (like Google, Facebook).",[45,169,170,173],{},[57,171,172],{},"Sacrificing Partial Security",": The disadvantage of this approach is also obvious—it cannot cover all certificate revocation situations. For an ordinary website's revoked certificate, CRLSets likely cannot detect it. According to Mozilla's blog this year, CRLSets only contains 1%-2% of unexpired revoked certificate information.",[18,175,176],{},"While CRLSets is an \"imperfect\" solution, it has found a balance between performance and usability. It ensures basic security for users accessing mainstream websites while avoiding the performance and privacy overhead brought by OCSP. For Chromium, rather than pursuing an OCSP solution that's difficult to implement perfectly in reality, it's better to concentrate efforts on solving the most urgent security threats.",[61,178,180],{"id":179},"firefoxs-solution-from-crls-to-crlite","Firefox's Solution: From CRLs to CRLite",[18,182,183],{},"Unlike Chromium's \"taking only a ladle\" strategy, Firefox developers have been searching for a solution that can guarantee comprehensiveness while solving performance issues.",[18,185,186,187,189,190,193,194,75],{},"To solve this problem, Mozilla proposed an innovative solution: ",[57,188,13],{},". CRLite's design philosophy is to use data structures like ",[57,191,192],{},"hash functions and Bloom filters"," to compress massive certificate revocation lists into a ",[57,195,196],{},"compact, downloadable, and easily locally verifiable format",[18,198,199],{},"CRLite's working principle can be simply summarized as:",[154,201,202,208,218],{},[45,203,204,207],{},[57,205,206],{},"Data Compression",": CAs periodically generate lists of all their revoked certificates.",[45,209,210,213,214,217],{},[57,211,212],{},"Server Processing",": Mozilla's servers collect these lists and use techniques like cryptographic hash functions and Bloom filters to ",[57,215,216],{},"encode"," all revoked certificate information into a very compact data structure.",[45,219,220,223],{},[57,221,222],{},"Client Verification",": The browser downloads this compressed file, and when accessing a website, it only needs to perform hash calculations on the certificate locally, then query this local file to quickly determine whether the certificate has been revoked.",[18,225,226,227,230,231,234,235,238,239,242],{},"Compared to CRLSets, CRLite's advantage is that it can achieve ",[57,228,229],{},"comprehensive coverage of all revoked certificates"," while maintaining an ",[57,232,233],{},"extremely small size",". More importantly, it ",[57,236,237],{},"completes verification entirely locally",", which means the browser ",[57,240,241],{},"doesn't need to send requests to any third-party servers",", thus completely solving OCSP's privacy problem.",[18,244,245],{},"Firefox's current strategy performs incremental updates to CRLite data every 12 hours, with daily downloads of approximately 300KB; it performs a full snapshot sync every 45 days, with downloads of approximately 4MB.",[18,247,248,249],{},"Mozilla has opened their data dashboard, where you can find recent CRLite data sizes: ",[25,250,251],{"href":251,"rel":252},"https://yardstick.mozilla.org/dashboard/snapshot/c1WZrxGkNxdm9oZp7xVvGUEFJCELfApN",[29],[18,254,255],{},"Starting with Firefox Desktop version 137 released on April 1, 2025, Firefox began gradually replacing OCSP validation with CRLite; on August 19 of the same year, Firefox Desktop 142 officially deprecated OCSP verification for DV certificates.",[18,257,258],{},"CRLite has become the core solution for Firefox's future certificate revocation verification, representing a comprehensive pursuit of performance, privacy, and security.",[61,260,262],{"id":261},"outlook-for-the-post-ocsp-era","Outlook for the Post-OCSP Era",[18,264,265],{},"With major CAs like Let's Encrypt shutting down OCSP services, the OCSP era is rapidly drawing to a close. We can see that browser vendors have already begun exploring more efficient and secure alternative solutions.",[42,267,268,277],{},[45,269,270,273,274,75],{},[57,271,272],{},"Chromium",", with its CRLSets solution, has achieved a pragmatic balance between ",[57,275,276],{},"performance and critical security guarantees",[45,278,279,281,282,284,285,75],{},[57,280,9],{},", through the technological innovation of ",[57,283,13],{},", attempts to find the optimal solution among ",[57,286,287],{},"comprehensiveness, privacy, and performance",[18,289,290,291,294],{},"What these solutions have in common is: ",[57,292,293],{},"transforming certificate revocation verification from real-time online queries (OCSP) to localized verification",", thereby avoiding OCSP's inherent performance bottlenecks and privacy risks.",[18,296,297,298],{},"In the future, the certificate revocation ecosystem will no longer rely on a single, centralized OCSP server. Instead, a more diverse, distributed, and intelligent new era is arriving. ",[57,299,300],{},"OCSP as a technology may gradually be phased out, but the core security problem of \"certificate revocation\" that it attempted to solve will forever remain a focus of browsers and the network security community.",[61,302,304],{"id":303},"see-also","See Also",[42,306,307,313,320,327,334,340,346,353,360,367,374],{},[45,308,309],{},[25,310,312],{"href":149,"rel":311},[29],"CRLite: Fast, private, and comprehensive certificate revocation checking in Firefox - Mozilla Hacks - the Web developer blog",[45,314,315],{},[25,316,319],{"href":317,"rel":318},"https://www.feistyduck.com/newsletter/issue_121_the_slow_death_of_ocsp",[29],"The Slow Death of OCSP | Feisty Duck",[45,321,322],{},[25,323,326],{"href":324,"rel":325},"https://github.com/mozilla/crlite",[29],"mozilla/crlite: Compact certificate revocation lists for the WebPKI",[45,328,329],{},[25,330,333],{"href":331,"rel":332},"https://letsencrypt.org/2025/08/06/ocsp-service-has-reached-end-of-life",[29],"OCSP Service Has Reached End of Life - Let's Encrypt",[45,335,336],{},[25,337,339],{"href":37,"rel":338},[29],"Ending OCSP Support in 2025 - Let's Encrypt",[45,341,342],{},[25,343,345],{"href":27,"rel":344},[29],"Intent to End OCSP Service - Let's Encrypt",[45,347,348],{},[25,349,352],{"href":350,"rel":351},"https://www.chromium.org/Home/chromium-security/crlsets/",[29],"CRLSets - The Chromium Projects",[45,354,355],{},[25,356,359],{"href":357,"rel":358},"https://www.pcworld.com/article/474296/google_chrome_will_no_longer_check_for_revoked_ssl_certificates_online-2.html",[29],"Google Chrome Will No Longer Check for Revoked SSL Certificates Online | PCWorld",[45,361,362],{},[25,363,366],{"href":364,"rel":365},"https://www.zdnet.com/article/chrome-does-certificate-revocation-better/",[29],"Chrome does certificate revocation better | ZDNET",[45,368,369],{},[25,370,373],{"href":371,"rel":372},"https://www.hats-land.com/WIP/2025-technical-and-analysis-of-mainstream-clientbrowser-certificate-revocation-verification-mechanism.html",[29],"主流客户端/浏览器证书吊销验证机制技术对与分析 | 帽之岛, Hat's Land",[45,375,376],{},[25,377,380],{"href":378,"rel":379},"https://blog.gslin.org/archives/2025/02/02/12239/ocsp-%E7%9A%84%E6%B7%A1%E5%87%BA/",[29],"OCSP 的淡出… – Gea-Suan Lin's BLOG",{"title":382,"searchDepth":383,"depth":383,"links":384},"",2,[385,390,391,392,393],{"id":63,"depth":383,"text":64,"children":386},[387,389],{"id":106,"depth":388,"text":107},3,{"id":117,"depth":388,"text":118},{"id":139,"depth":383,"text":140},{"id":179,"depth":383,"text":180},{"id":261,"depth":383,"text":262},{"id":303,"depth":383,"text":304},[395,401],{"title":396,"path":397,"stem":398,"date":399,"lang":400,"children":-1},"Array Field Filtering Challenges and Performance Optimization in Nuxt Content v3","/2025/10/20/nuxt-content-v3-z-array-query-challenge","posts/en/nuxt-content-v3-z-array-query-challenge","2025-10-20 21:52:59","en",{"title":402,"path":403,"stem":404,"date":405,"lang":400,"children":-1},"First Experience with GitHub Action Self-hosted Runner: Love is Not Easy","/2025/09/05/first-try-of-github-action-self-hosted-runner","posts/en/first-try-of-github-action-self-hosted-runner","2025-09-05 05:54:17",10,"/2025/10/16/how-s-mozilla-crlite-going-now/",1766526712567]